def area(a, b):
    '''
    Возвращает площадь прямоугольника
        
        Параметры:
            a (int): длина одной стороны
            b (int): длина второй стороны

        Возвращаемое значение:
            a * b: площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника

        Параметры:
            a (int): длина одной стороны
            b (int): длина второй стороны

        Возвращаемое значение:
            2 * a + 2 * b: периметр прямоугольника
    '''
    return 2 * a + 2 * b